using System;
using System.Collections.Generic;

namespace Amlakbashi.Core.Infrastructure.LocalizationHelpers
{
    public static class GeneralLocalization
    {
        public static string GetExceptionMessage(Exception exc)
        {
            return "متاسفانه عملیات با خطای فنی مواجه شد. کد خطا: " + exc.HResult;
        }

        public static Dictionary<string, IList<string>> GetSupportPhoneNumbers()
        {
            var phoneNumbers = new Dictionary<string, IList<string>>();
            phoneNumbers.Add("supports", new List<string>
            {
                "02632565304",
                "02632565357",
                "02632565296",
                "09360263804"
            });
            phoneNumbers.Add("hostSupports", new List<string>
            {
                "02632554756",
                "09196218216"
            });
            return phoneNumbers;
        }

        public static string GetAmlakbashiAddress()
        {
            return "استان البرز، کرج، منطقه شهرداری هشت، بلوار آزادگان، ساختمان آراد، پلاک ۸۶۹، طبقه اول، واحد ۳";
        }

        public static Dictionary<string, string> GetFaq()
        {
            var faqs = new Dictionary<string, string>();
            faqs.Add("چگونه عضو سایت شوم؟",
                @"مرحله ۱: از بالای سایت گزینه <strong>ورود</strong> را انتخاب کنید<br />
                مرحله ۲: شماره موبایل خود را وارد کنید <br />
                مرحله ۳: اس ام اسی برای شما ارسال می شود که حاوی کد تایید شماست، کد را در کادر مشخص وارد کنید");

            faqs.Add("چگونه درخواست رزرو بدهم؟",
                @"مرحله ۱: طبق توضیحات بالا عضو سایت شوید<br />
                مرحله ۲: آگهی مورد نظر خود را انتخاب کنید<br />
                مرحله ۳: روی عکس یا عنوان آن کلیک کنید<br />
                مرحله ۴: در قسمت تقویم تاریخ شروع و پایان سفر خود و تعداد نفرات را وارد کنید<br />
                مرحله ۵: روی کادر زرد رنگ <strong>درخواست رزرو</strong> کلیک کنید<br />
                مرحله ۶: قوانین و مقررات سایت و اقامتگاه را مطالعه و تیک آن را فعال کنید <br />
                مرحله ۷: ثبت را انتخاب کنید <br />
                مرحله ۸: منتظر پیامک تایید یا رد درخواست خود توسط میزبان باشید(در این مرحله میتوانید با میزبان از طریق چت سایت در تماس باشید) <br />
                مرحله ۹: پس از تایید میزبان لینک پرداخت برای شما پیامک میشود <br />
                مرحله ۱۰: با پرداخت مبلغ درخواست رزرو شما تکمیل شده و پیامکی حاوی شماره تماس میزبان دریافت خواهید کرد");


            faqs.Add("من میزبان هستم چگونه متوجه بشم که درخواست رزرو دارم؟",
                @"بعد از درخواست رزرو پیامکی حاوی اطلاعات رزرو دریافت می کنید<br />
                با ارسال عدد ۱ به شماره 10008412 درخواست را قبول می کنید<br />
                با ارسال عدد ۲ به شماره 10008412 درخواست را رد می کنید<br />
                با ارسال عدد ۳ به شماره 10008412 درخواست را بدلیل قیمت کم است رد می کنید<br />
                با ارسال عدد ۴ به شماره 10008412 درخواست را بدلیل پر بودن رد می کنید<br />
                نکته :  حتما با همان شماره ای که برای شما پیامک آمده است ، به شماره 10008412 پاسخ دهید در غیر این صورت پاسخ شما در سیستم وارد نمیشود<br />
                همچنین میتوانید از طریق بخش <strong>حساب من</strong> و در قسمت رزرو ها درخواست های رزرو را مدیریت کنید");

            faqs.Add("چطور از وضعیت درخواست هایم مطلع شوم؟",
                @"با ورود به <strong>حساب من</strong> گزینه رزرو ها را از منو سمت راست انتخاب کنید");

            faqs.Add("چگونه می توانم شماره میزبان و آدرس را داشته باشم؟",
                @"پس از انجام مراحل رزرو و پرداخت، شماره تماس میزبان برای شما در بخش رزروها نمایان می شود شما میتوانید با میزبان ارتباط بگیرید");

            faqs.Add("چطور کد آگهی را در سایت جستجو کنم؟",
                @"در صفحه اول سایت در کادر جستجو کد آگهی را وارد کنید");

            faqs.Add("طریقه پرداخت هزینه اقامتگاه چگونه است؟",
                @"پرداخت هزیته بصورت اینترنتی و از طریق درگاه امن سایت بصورت پیش پرداخت و الباقی مبلغ در زمان تحویل کلید و مطابقت اطلاعات اقامتگاه با اطلاعات درج شده در سایت ،شما به میزبان پرداخت می کنید<br />
                نکته : دقت فرمایید که مبلغ پیش پرداخت برای یک و دو شب معادل هزینه یک شب و برای بیشتر از دو شب معادل 30درصد مبلغ کل تعیین گردیده است");

            faqs.Add("من مهمان هستم درخواست رزرو داده ام چطور میتوانم درخواست رزرو را لغو کنم؟",
                @"درصورتیکه پیش پرداخت انجام نشده باشد با رفتن به گزینه رزرو ها گزینه لغو درخواست رزرو را انتخاب کنید");

            faqs.Add("درصورت مغایرت اطلاعات ثبت شده در سایت با شرایط موجود اقامتگاه مغایرت داشته باشد چکار باید بکنم؟",
                @"در صورت مطابقت نداشتن محل اقامت با توضیحات ارائه شده توسط میزبان از قیبل متراژ و تعداد خواب و ... کل مبلغ به مهمان مسترد میشود");

            faqs.Add("چگونه ملک خود را در سایت املاک باشی ثبت کنم؟",
                @"بعد از ثبت نام و عضویت در سایت روی گرینه <strong>ثبت آگهی</strong> کلیک کنید و مراحل ثبت را طی کنید<br />
                نکته: میزبان محترم دقت داشته باشید در هر آگهی فقط می توانید عکس و اطلاعات مربوط به یک اقامتگاه را ثبت کنید");

            faqs.Add("قیمت های ثبت شده برای چند شب و چند نفر است؟",
                @"بری یک شب و تعداد نفراتی که در آگهی قید شده ، توجه داشته باشید که نفرات اضافه هزینه جداگانه محاسبه میگردد");

            faqs.Add("در زمان تحویل واحد چه مدارکی مورد نیاز هست؟",
                @"کارت ملی و در صورت زوج بودن ارائه اصل شناسنامه");

            faqs.Add("آیا پس از رزرو می توانم تغییراتی در آن اعمال کنم؟",
                @"با هماهنگی میزبان و مهمان تغییرات را به پشتیبان سایت اعلام کنید تا اعمال گردد");

            faqs.Add("پیامک های ارسالی به میزبان و مهمان تا چند ساعت اعتبار دارد؟",
                @"میزبان و مهمان محترم توجه داشته باشید که پیامک های ارسالی تا سه ساعت در ساعات کاری معتبر میباشد مگر اینکه طرفین با یکدیگر هماهنگ کرده باشند
                نکته: سرعت عمل در پاسخگویی شما به بالا بردن امتیاز آگهی شما و در نتیجه به نمایش بیشتر آن کمک می کند");
            return faqs;
        }
    }
}
