using Amlakbashi.Core.Common.StaticData;
using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;
using static Amlakbashi.Core.Entities.SupportChat;

namespace Amlakbashi.Core.Infrastructure.LocalizationHelpers
{
    public static class SupportChatLocalization
    {
        public static string GetQuestionTitle(AutoQuestion question)
        {
            switch (question)
            {
                case AutoQuestion.questionHowToReserve:
                    return "راهنمای رزرو اقامتگاه؟";
                case AutoQuestion.questionHowToContactHost:
                    return "شماره تماس میزبان؟";
                case AutoQuestion.questionCheckInCheckout:
                    return "ساعت تحویل و تخلیه؟";
                case AutoQuestion.questionEvidence:
                    return "مدارک مورد نیاز؟";
                case AutoQuestion.questionCancelReserveRules:
                    return "قوانین کنسلی؟";
                case AutoQuestion.questionPaymentGuest:
                    return "نحوه ی پرداخت؟";
                case AutoQuestion.questionPaymentHost:
                    return "زمان تسویه با میزبان؟";
                default:
                    return "";
            }
        }

        public static string GetQuestionText(AutoQuestion question)
        {
            switch (question)
            {
                case AutoQuestion.questionHowToReserve:
                    return "مراحل رزرو از سایت املاک باشی" + "\n\n" +
                        "1- از طریق کادر جستجو مقصد سفر خود را سرچ کنید" + "\n\n" +
                        "2- از فیلتر بالای سایت میتوانید تعداد نفرات و تاریخ سفر را فیلتر کنید و از بخش فیلترهای بیشتر ، محدوده قیمت ، استخر ، تعداد اتاق خواب و سایر موارد مد نظر را انتخاب کنید سپس بر روی دکمه اعمال فیلتر کلیک نمایید تا اقامتگاه های مناسب شما نمایش داده شود" + "\n\n" +
                        "3- موارد یافت شده را چک کنید و اقامتگاه مورد پسندتان را با کلیک بر روی آگهی باز کنید" + "\n\n" +
                        "4- اطلاعات اقامتگاه را مطالعه کنید و در صورت تمایل درخواست رزرو را ثبت کنید و منتظر پیامک یا تماس از طریق سایت باشید" + "\n\n" +
                        "." + "\n\n" +
                        "." + "\n\n" +
                        "دانلود اپلیکیشن املاک باشی" + "\n\n" +
                        "👇" + "\n\n" +
                        GeneralData.WebsiteUrl + "/post/downloadapp";
                case AutoQuestion.questionHowToContactHost:
                    return "شماره میزبان را میخواهم؟" + "\n" +
                        "شماره میزبان بعد از رزرو قطعی و پرداخت برای شما پیامک میشود ." + "\n\n" +
                        "چطور سوالاتم را از میزبان بپرسم؟" + "\n" +
                        "درخواست رزرو را برای واحدی که مورد پسند شماست ثبت کنید (ثبت درخواست رزرو رایگان میباشد ) سپس میتوانید از طریق چت با میزبان با ایشان گفتگو کنید . پشتیبانها نیز درخواستها و سوالات شما را پیگیری خواهند کرد و با شما تماس خواهند گرفت.";
                case AutoQuestion.questionCheckInCheckout:
                    return "تحویل و تخلیه چه ساعتی میباشد؟" + "\n" +
                     "قانونا تحویل ساعت 2 ظهر و تخلیه 12 ظهر میباشد" + "\n\n" +
                     "آیا ساعت تحویل/تخلیه میتواند تغییر کند؟" + "\n" +
                     "درخواست رزرو را برای واحدی که مورد پسند شماست ثبت کنید (ثبت درخواست رزرو رایگان میباشد ) سپس میتوانید از طریق چت با میزبان با ایشان در این باره گفتگو کنید . پشتیبانها نیز درخواستها و سوالات شما را پیگیری خواهند کرد ." + "\n\n" +
                     "آیا میتوانم واحد را صبح تحویل بگیرم؟" + "\n" +
                     "معمولا به این دلیل که مهمان قبلی شما تا ساعت قانونی یعنی 12 ظهر داخل واحد میباشد و میزبان ساعتی را برای نظافت واحد در نظر میگیرد این امکان وجود ندارد مگر اینکه مهمان قبلی شما زودتر واحد را تخلیه کند یا اینکه شب قبل واحد خالی بماند . با این حال میتوانید درخواست رزرو را برای واحدی که مورد پسند شماست ثبت کنید (ثبت درخواست رزرو رایگان میباشد ) سپس میتوانید از طریق چت با میزبان با ایشان در این باره گفتگو کنید . پشتیبانها نیز درخواستها و سوالات شما را پیگیری خواهند کرد ." + "\n\n" +
                     "آیا میتوانم واحد را دیرتر تخلیه کنم؟" + "\n" +
                     "معمولا به این دلیل که مهمان بعدی شما ، ساعت قانونی یعنی 2 ظهر واحد را تحویل میگیرد و میزبان ساعتی را برای نظافت واحد در نظر میگیرد این امکان وجود ندارد مگر اینکه مهمان بعدی شما دیرتر واحد را تحویل بگیرد یا اینکه روز بعد واحد خالی باشد . با این حال میتوانید درخواست رزرو را برای واحدی که مورد پسند شماست ثبت کنید (ثبت درخواست رزرو رایگان میباشد ) سپس میتوانید از طریق چت با میزبان با ایشان در این باره گفتگو کنید . پشتیبانها نیز درخواستها و سوالات شما را پیگیری خواهند کرد .";
                case AutoQuestion.questionEvidence:
                    return "مدارک مورد نیاز برای رزرو اقامتگاه چیست؟" + "\n" +
                        "مدارک دریافتی مورد نیاز هر میزبان در قسمت قوانین و مقررات هر آگهی ذکر شده است ." + "\n\n" +
                        "آیا ارائه مدارک محرمیت الزامیست؟" + "\n" +
                        "طبق قوانین سایت ارائه مدرک محرمیت الزامی است و اجرای این قانون وظیفه میزبان میباشد .";
                case AutoQuestion.questionCancelReserveRules:
                    return "شرایط و قوانین لغو کردن رزرو" + "\n" +
                        "تحویل ملک ساعت 14:00 و زمان تخلیه ملک ساعت 12:00 توسط میزبانان تعیین شده‌است. (مگر اینکه میهمان و میزبان از قبل با یکدیگر هماهنگ نمایند)" + "\n" +
                        "کنسل نمودن رزرو توسط میزبان کسر ۱۰٪ از مبلغ کل رزرو ( سهم املاک باشی ) از حساب میزبان و بازگشت کل مبلغ به مهمان" + "\n" +
                        "کنسل نمودن رزرو توسط میهمان تا ۷۲ ساعت مانده به شروع اقامت: کسر ۱۰٪ از مبلغ کل رزرو ( سهم املاک باشی ) و بازگشت باقی‌مانده مبلغ." + "\n" +
                        "کنسل نمودن رزرو توسط میهمان کمتر از ۷۲ ساعت مانده به شروع اقامت: کسر مبلغ اولین شب رزرو و بازگشت باقی‌مانده مبلغ." + "\n" +
                        "کنسل نمودن رزرو توسط میهمان در روز شروع اقامت: کسر مبلغ ۲ شب اول رزرو و بازگشت باقی‌مانده مبلغ" + "\n" +
                        "در ایام پیک تعطیلات ، بازه‌ی ۷۲ ساعت، ۱ هفته محاسبه می‌شود و امکان کنسلی وجود ندارد" + "\n" +
                        "در صورت مراجعه نکردن میهمان در زمان رزرو، محل اقامت برای میهمان خالی نگه داشته شده و هيچ‌ گونه وجهی مسترد نخواهد شد." + "\n" +
                        "در صورت مطابقت نداشتن محل اقامت با توضیحات ارائه شده توسط میزبان در آگهی از قبیل متراژ و تعداد خواب و ... کل مبلغ به میهمان مسترد ( میهمان گرامی درصورت مغایرت واحد را تحویل نگیرید در صورت تحویل واحد هزینه مسترد نخواهد شد )" + "\n" +
                        "مهمان تنها 3 ساعت بعد از تاریخ شروع رزرو خود مهلت دارد تا یکی از موارد بالا را برای استرداد پول خود از طریق سایت \"املاک باشی\" یا از طریق راه های ارتباطی به سایت اعلام کند. ( شرایط ذکر شده برای استرداد پول مهمان غیرقابل تغییر و جایگزینی هستند.)" + "\n" +
                        "در صورت لغو رزرو توسط میزبان ، مهمان می تواند انتخاب کند یا تمامی پول به او بازگردانده شود و یا با انتخاب اقامتگاه جدید مبلغ به کیف پول مهمان عودت داده میشود و میتواند از مبلغ برای رزرو واحد جدید استفاده نماید، سایت پیش پرداخت را برای رزرو جدید در نظر گرفته و همچنین میزبان باید بداند که این لغو رزرو در بازخورد صفحه اش به صورت خودکار ثبت خواهد شد ." + "\n";
                case AutoQuestion.questionPaymentGuest:
                    return "نحوه پرداخت مهمان" + "\n" +
                     "بعد از قبول درخواست رزرو توسط میزبان از راه های زیر می توانید پرداخت را انجام دهید" + "\n" +
                     "1- لینک پرداخت برای شما پیامک میشود با کلیک روی لینک به درگاه بانک متصل میشود" + "\n" +
                     "2- با ورود به حساب کابری ( حساب من) > رزرو های من > رزرو های در انتظار پرداخت > روی گزینه پرداخت کلیک کنید" + "\n" +
                     "3- درصورتیکه رمز دوم ندارید در ساعات کاری ( 9 صبح تا 11/30 شب ) مبلغ را به شماره کارت 5022291011509526 بانک پاسارگاد بنام محمدعلی سهرابی نیا واریز نمائید و فیش واریزی را به شماره 09360263804 واتساپ کنید" + "\n";
                case AutoQuestion.questionPaymentHost:
                    return "زمان تسویه با میزبان" + "\n" +
                     "رزرو های یک روزه پس از 24 ساعت از شروع سفر و رزرو های بیشتر از 2 روز پس از 48 ساعت تسویه حساب میشود" + "\n" +
                     "ساعت پرداخت از ساعت 12 تا 14 میباشد";
                default:
                    return "";
            }
        }

        public static string GetClosedCompanyMessage()
        {
            return "کاربر گرامی، ساعت کاری شرکت از 9 صبح تا 9 شب می باشد.";
        }
    }
}
